In [1]:
# Data ingestion

# About data

##### Total Column in data = 10

- N_SOIL: Nitrogen content in the soil (measured in some unit like kg/ha or ppm).
- P_SOIL: Phosphorus content in the soil (measured in some unit like kg/ha or ppm).
- K_SOIL: Potassium content in the soil (measured in some unit like kg/ha or ppm).
- TEMPERATURE: Temperature of the area (measured in Celsius or Fahrenheit).
- HUMIDITY: Humidity level in the air (expressed in percentage).
- pH: pH level of the soil (indicating its acidity or alkalinity).
- RAINFALL: Amount of rainfall (measured in some unit like mm).
- STATE: Name or identifier of the state or region where the data was recorded (e.g., "Andaman and Nicobar").
- CROP: Type of crop being cultivated in the specified area (e.g., "Rice").

##### Target value

- CROP_PRICE: Price of the crop per unit (e.g., per kg or per ton).

In [2]:
import pandas as pd

In [23]:
data=pd.read_csv(r"D:\\CropPricePrediction\\notebooks\\data\\CropPricePrediction.csv")

In [25]:
data.head()

,N_SOIL,P_SOIL,K_SOIL,TEMPERATURE,HUMIDITY,ph,RAINFALL,STATE,CROP,CROP_PRICE
0,90,42,43,20.879744,82.002744,6.502985,202.935536,Andaman and Nicobar,Rice,7000
1,85,58,41,21.770462,80.319644,7.038096,226.655537,Andaman and Nicobar,Rice,5000
2,60,55,44,23.004459,82.320763,7.840207,263.964248,Andaman and Nicobar,Rice,7000
3,74,35,40,26.491096,80.158363,6.980401,242.864034,Andaman and Nicobar,Rice,7000
4,78,42,42,20.130175,81.604873,7.628473,262.717340,Andaman and Nicobar,Rice,120000

In [26]:
data.tail()

,N_SOIL,P_SOIL,K_SOIL,TEMPERATURE,HUMIDITY,ph,RAINFALL,STATE,CROP,CROP_PRICE
2195,107,34,32,26.774637,66.413269,6.780064,177.774507,West Bengal,Coffee,1000
2196,99,15,27,27.417112,56.636362,6.086922,127.924610,West Bengal,Coffee,800
2197,118,33,30,24.131797,67.225123,6.362608,173.322839,West Bengal,Coffee,560
2198,117,32,34,26.272418,52.127394,6.758793,127.175293,West Bengal,Coffee,1500
2199,104,18,30,23.603016,60.396475,6.779833,140.937041,West Bengal,Coffee,1400

In [29]:
data.sample(5)

,N_SOIL,P_SOIL,K_SOIL,TEMPERATURE,HUMIDITY,ph,RAINFALL,STATE,CROP,CROP_PRICE
1888,8,28,30,25.516185,94.334654,6.015672,135.127249,Uttar Pradesh,Coconut,1932
584,20,50,22,30.996947,46.426937,9.406888,38.315979,Kerala,MothBeans,1700
1536,18,125,204,22.355482,94.478118,6.046674,116.736626,Uttar Pradesh,Apple,2250
135,98,44,21,25.771751,74.089114,6.524478,107.493192,Gujarat,Maize,3755
668,30,37,25,29.891291,80.144872,7.120032,54.796013,Kerala,MungBean,1200

In [34]:
data.isnull().sum()

N_SOIL         0
P_SOIL         0
K_SOIL         0
TEMPERATURE    0
HUMIDITY       0
ph             0
RAINFALL       0
STATE          0
CROP           0
CROP_PRICE     0
dtype: int64

In [35]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   N_SOIL       2200 non-null   int64
 1   P_SOIL       2200 non-null   int64
 2   K_SOIL       2200 non-null   int64
 3   TEMPERATURE  2200 non-null   float64
 4   HUMIDITY     2200 non-null   float64
 5   ph           2200 non-null   float64
 6   RAINFALL     2200 non-null   float64
 7   STATE        2200 non-null   object
 8   CROP         2200 non-null   object
 9   CROP_PRICE   2200 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 172.0+ KB

In [36]:
data.duplicated().sum()

0

In [37]:
data.shape

(2200, 10)

### Categorical and Numerical Columns

In [43]:
categorical_column=data.columns[data.dtypes=="object"]

In [44]:
numerical_column=data.columns[data.dtypes!="object"]

In [45]:
categorical_column

Index(['STATE', 'CROP'], dtype='object')

In [46]:
numerical_column

Index(['N_SOIL', 'P_SOIL', 'K_SOIL', 'TEMPERATURE', 'HUMIDITY', 'ph',
       'RAINFALL', 'CROP_PRICE'],
      dtype='object')

In [53]:
data[numerical_column].describe()  # Showing the mean,median, mode n all

,N_SOIL,P_SOIL,K_SOIL,TEMPERATURE,HUMIDITY,ph,RAINFALL,CROP_PRICE
count,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000
mean,50.551818,53.362727,48.149091,25.616244,71.481779,6.469480,103.463655,2689.228182
std,36.917334,32.985883,50.647931,5.063749,22.263812,0.773938,54.958389,3710.361267
min,0.000000,5.000000,5.000000,8.825675,14.258040,3.504752,20.211267,2.000000
25%,21.000000,28.000000,20.000000,22.769375,60.261953,5.971693,64.551686,950.000000
50%,37.000000,51.000000,32.000000,25.598693,80.473146,6.425045,94.867624,1825.000000
75%,84.250000,68.000000,49.000000,28.561654,89.948771,6.923643,124.267508,3500.000000
max,140.000000,145.000000,205.000000,43.675493,99.981876,9.935091,298.560117,120000.000000

In [54]:
data[categorical_column].describe()

                STATE  CROP
count            2200  2200
unique             26    22
top     Uttar Pradesh  Rice
freq              574   100

In [59]:
data[categorical_column]["STATE"].value_counts()

STATE
Uttar Pradesh          574
Kerala                 274
Tamil Nadu             183
Punjab                 180
Maharashtra            162
West Bengal            124
Gujarat                113
Himachal Pradesh       102
Odisha                  86
Haryana                 65
Assam                   58
Manipur                 52
Madhya Pradesh          44
Rajasthan               41
Karnataka               36
Uttrakhand              21
Tripura                 18
Telangana               15
Andaman and Nicobar     15
Andhra Pradesh           7
Pondicherry              7
Meghalaya                6
Nagaland                 6
Chattisgarh              5
Jammu and Kashmir        3
Goa                      3
Name: count, dtype: int64